{
  "title": "Revised Constraints on the fast radio burst population from the first CHIME/FRB catalog",
  "authors": [
    "Hai-Nan Lin",
    "Rui Zou"
  ],
  "submission_date": "2023-09-06T11:02:02+00:00",
  "revised_dates": [
    "2024-01-05T15:48:04+00:00"
  ],
  "publication_venue": "Astrophys. J. 962 (2024) 73",
  "abstract": "In this paper, we investigate the FRB population using the first CHIME/FRB\ncatalog. We first reconstruct the extragalactic dispersion measure -- redshift\nrelation ($\\mathrm{DM_E} - z$ relation) from well-localized FRBs, then use it\nto infer redshift and isotropic energy of the first CHIME/FRB catalog. The\nintrinsic energy distribution is modeled by the power law with an exponential\ncutoff, and the selection effect of the CHIME telescope is modeled by a\ntwo-parametric function of specific fluence. For the intrinsic redshift\ndistribution, the star formation history (SFH) model, as well as other five\nSFH-related models are considered. We construct the joint likelihood of\nfluence, energy and redshift, and all the free parameters are constrained\nsimultaneously using Bayesian inference method. The Bayesian information\ncriterion (BIC) is used to choose the model that best matches the observational\ndata. For comparison, we fit our models with two data samples, i.e. the Full\nsample and the Gold sample. The power-law index and cutoff energy are tightly\nconstrained to be $1.8 \\lesssim \\alpha \\lesssim 1.9$ and $\\mathrm{log}(E_c/{\\rm\nerg}) \\approx 42$, which are almost independent of the redshift distribution\nmodel and the data sample we choose. The parameters involving the selection\neffect strongly depends on the data sample, but are insensitive to the redshift\ndistribution model. According to BIC, the pure SFH model is strongly disfavored\nby both the Full sample and Gold sample. For the rest five SFH-related redshift\ndistribution models, most of them can match the data well if the parameters are\nproperly chosen. Therefore, with the present data, it is still premature to\ndraw a conclusive conclusion on the FRB population.",
  "categories": [
    "astro-ph.HE"
  ],
  "arxiv_id": "2309.02907"
}