{
  "title": "Getting too personal(ized): The importance of feature choice in online adaptive algorithms",
  "authors": [
    "ZhaoBin Li",
    "Luna Yee",
    "Nathaniel Sauerberg",
    "Irene Sakson",
    "Joseph Jay Williams",
    "Anna N. Rafferty"
  ],
  "submission_date": "2023-09-06T09:34:54+00:00",
  "revised_dates": [
    "2023-09-06T09:34:54+00:00"
  ],
  "publication_venue": null,
  "abstract": "Digital educational technologies offer the potential to customize students'\nexperiences and learn what works for which students, enhancing the technology\nas more students interact with it. We consider whether and when attempting to\ndiscover how to personalize has a cost, such as if the adaptation to personal\ninformation can delay the adoption of policies that benefit all students. We\nexplore these issues in the context of using multi-armed bandit (MAB)\nalgorithms to learn a policy for what version of an educational technology to\npresent to each student, varying the relation between student characteristics\nand outcomes and also whether the algorithm is aware of these characteristics.\nThrough simulations, we demonstrate that the inclusion of student\ncharacteristics for personalization can be beneficial when those\ncharacteristics are needed to learn the optimal action. In other scenarios,\nthis inclusion decreases performance of the bandit algorithm. Moreover,\nincluding unneeded student characteristics can systematically disadvantage\nstudents with less common values for these characteristics. Our simulations do\nhowever suggest that real-time personalization will be helpful in particular\nreal-world scenarios, and we illustrate this through case studies using\nexisting experimental results in ASSISTments. Overall, our simulations show\nthat adaptive personalization in educational technologies can be a double-edged\nsword: real-time adaptation improves student experiences in some contexts, but\nthe slower adaptation and potentially discriminatory results mean that a more\npersonalized model is not always beneficial.",
  "categories": [
    "cs.AI",
    "cs.CY"
  ],
  "arxiv_id": "2309.02856"
}