{
  "title": "Identifying frequency decorrelated dust residuals in B-mode maps by exploiting the spectral capability of bolometric interferometry",
  "authors": [
    "M. Regnier",
    "E. Manzan",
    "J. -Ch Hamilton",
    "A. Mennella",
    "J. Errard",
    "L. Zapelli",
    "S. A. Torchinsky",
    "S. Paradiso",
    "E. Battistelli",
    "P. De Bernardis",
    "L. Colombo",
    "M. De Petris",
    "G. D'Alessandro",
    "B. Garcia",
    "M. Gervasi",
    "S. Masi",
    "L. Mousset",
    "N. Miron Granese",
    "C. O'Sullivan",
    "M. Piat",
    "E. Rasztocky",
    "G. E. Romero",
    "C. G. Scoccola",
    "M. Zannoni"
  ],
  "submission_date": "2023-09-06T12:49:56+00:00",
  "revised_dates": [
    "2024-02-21T12:55:13+00:00"
  ],
  "publication_venue": "A&A 686, A271 (2024)",
  "abstract": "Astrophysical polarized foregrounds represent the most critical challenge in\nCosmic Microwave Background (CMB) B-mode experiments. Multi-frequency\nobservations can be used to constrain astrophysical foregrounds to isolate the\nCMB contribution. However, recent observations indicate that foreground\nemission may be more complex than anticipated.\n  We investigate how the increased spectral resolution provided by band\nsplitting in Bolometric Interferometry (BI) through a technique called spectral\nimaging can help control the foreground contamination in the case of\nunaccounted Galactic dust frequency decorrelation along the line-of-sight.\n  We focus on the next generation ground-based CMB experiment CMB-S4, and\ncompare its anticipated sensitivities, frequency and sky coverage with a\nhypothetical version of the same experiment based on BI. We perform a\nMonte-Carlo analysis based on parametric component separation methods (FGBuster\nand Commander) and compute the likelihood on the recovered tensor-to-scalar\nratio.\n  The main result of this analysis is that spectral imaging allows us to detect\nsystematic uncertainties on r from frequency decorrelation when this effect is\nnot accounted for in component separation. Conversely, an imager would detect a\nbiased value of r and would be unable to spot the presence of a systematic\neffect. We find a similar result in the reconstruction of the dust spectral\nindex, where we show that with BI we can measure more precisely the dust\nspectral index also when frequency decorrelation is present.\n  The in-band frequency resolution provided by BI allows us to identify dust\nLOS frequency decorrelation residuals where an imager of similar performance\nwould fail. This opens the prospect to exploit this potential in the context of\nfuture CMB polarization experiments that will be challenged by complex\nforegrounds in their quest for B-modes detection.",
  "categories": [
    "astro-ph.CO"
  ],
  "arxiv_id": "2309.02957"
}