{
  "title": "Determining the Baryon Impact on the Matter Power Spectrum with Galaxy Clusters",
  "authors": [
    "Sebastian Grandis",
    "Giovanni Arico'",
    "Aurel Schneider",
    "Laila Linke"
  ],
  "submission_date": "2023-09-06T11:32:06+00:00",
  "revised_dates": [
    "2024-03-13T15:21:32+00:00"
  ],
  "publication_venue": null,
  "abstract": "The redistribution of baryonic matter in massive halos through processes like\nactive galactic nuclei feedback and star formation leads to a suppression of\nthe matter power spectrum on small scales. This redistribution can be measured\nempirically via the gas and stellar mass fractions in galaxy clusters, and\nleaves imprints on their electron density profiles. We constrain two\nsemi-analytical baryon correction models with a compilation of recent Bayesian\npopulation studies of galaxy groups and clusters sampling a mass range above\n$\\sim 3 \\times 10^{13}$ $M_\\odot$, and with cluster gas density profiles\nderived from deep, high-resolution X-ray observations. We are able to fit all\nthe considered observational data, but highlight some anomalies in the\nobservations. The constraints allow us to place precise, physically informed\npriors on the matter power spectrum suppression. At a scale of $k=1 h$\nMpc$^{-1}$ we find a suppression of $0.042^{+0.012}_{-0.014}$\n($0.049^{+0.016}_{-0.012}$), while at $k=3h$ Mpc$^{-1}$ we find\n$0.184^{+0.026}_{-0.031}$ ($0.179^{+0.018}_{-0.020}$), depending on the model\nused. In our fiducial setting, we also predict at 97.5 percent credibility,\nthat at scales $k<0.37h$ Mpc$^{-1}$ baryon feedback impacts the matter power\nless than $1\\%$. This puts into question if baryon feedback is the driving\nfactor for the discrepancy between cosmic shear and primary CMB results. We\nindependently confirm results on this suppression from small-scale cosmic shear\nstudies, while we exclude some hydro-dynamical simulations with too strong and\ntoo weak baryonic feedback. Our empirical prediction of the power spectrum\nsuppression shows that studies of galaxy groups and clusters will be\ninstrumental in unlocking the cosmological constraining power of future cosmic\nshear experiments like \\textit{Euclid} and Rubin-LSST, and invites further\ninvestigation of the baryon correction models.",
  "categories": [
    "astro-ph.CO"
  ],
  "arxiv_id": "2309.02920"
}