{
  "title": "Nonconforming Virtual Element basis functions for space-time Discontinuous Galerkin schemes on unstructured Voronoi meshes",
  "authors": [
    "Walter Boscheri",
    "Giulia Bertaglia"
  ],
  "submission_date": "2023-09-06T10:17:37+00:00",
  "revised_dates": [
    "2023-09-06T10:17:37+00:00"
  ],
  "publication_venue": "Commun. Comput. Phys. 36 (2024) 348-388",
  "abstract": "We introduce a new class of Discontinuous Galerkin (DG) methods for solving\nnonlinear conservation laws on unstructured Voronoi meshes that use a\nnonconforming Virtual Element basis defined within each polygonal control\nvolume. The basis functions are evaluated as an L2 projection of the virtual\nbasis which remains unknown, along the lines of the Virtual Element Method\n(VEM). Contrarily to the VEM approach, the new basis functions lead to a\nnonconforming representation of the solution with discontinuous data across the\nelement boundaries, as typically employed in DG discretizations. To improve the\ncondition number of the resulting mass matrix, an orthogonalization of the full\nbasis is proposed. The discretization in time is carried out following the ADER\n(Arbitrary order DERivative Riemann problem) methodology, which yields one-step\nfully discrete schemes that make use of a coupled space-time representation of\nthe numerical solution. The space-time basis functions are constructed as a\ntensor product of the virtual basis in space and a one-dimensional Lagrange\nnodal basis in time. The resulting space-time stiffness matrix is stabilized by\nan extension of the dof-dof stabilization technique adopted in the VEM\nframework, hence allowing an element-local space-time Galerkin finite element\npredictor to be evaluated. The novel methods are referred to as VEM-DG schemes,\nand they are arbitrarily high order accurate in space and time. The new VEM-DG\nalgorithms are rigorously validated against a series of benchmarks in the\ncontext of compressible Euler and Navier-Stokes equations. Numerical results\nare verified with respect to literature reference solutions and compared in\nterms of accuracy and computational efficiency to those obtained using a\nstandard modal DG scheme with Taylor basis functions. An analysis of the\ncondition number of the mass and space-time stiffness matrix is also forwarded.",
  "categories": [
    "math.NA",
    "cs.CE",
    "cs.NA",
    "physics.flu-dyn"
  ],
  "arxiv_id": "2309.02882"
}