{
  "title": "A search for the afterglows, kilonovae, and host galaxies of two short GRBs: GRB 211106A and GRB 211227A",
  "authors": [
    "M. Ferro",
    "R. Brivio",
    "P. D'Avanzo",
    "A. Rossi",
    "L. Izzo",
    "S. Campana",
    "L. Christensen",
    "M. Dinatolo",
    "S. Hussein",
    "A. J. Levan",
    "A. Melandri",
    "M. G. Bernardini",
    "S. Covino",
    "V. D'Elia",
    "M. Della Valle",
    "M. De Pasquale",
    "B. P. Gompertz",
    "D. Hartmann",
    "K. E. Heintz",
    "P. Jakobsson",
    "C. Kouveliotou",
    "D. B. Malesani",
    "A. Martin-Carrillo",
    "L. Nava",
    "A. Nicuesa Guelbenzu",
    "G. Pugliese",
    "C. Salvaggio",
    "R. Salvaterra",
    "S. Savaglio",
    "T. Sbarrato",
    "N. R. Tanvir",
    "R. A. M. J. Wijers",
    "T. Zafar"
  ],
  "submission_date": "2023-09-06T13:45:36+00:00",
  "revised_dates": [
    "2023-09-06T13:45:36+00:00"
  ],
  "publication_venue": "A&A 678, A142 (2023)",
  "abstract": "Context: GRB 211106A and GRB 211227A are recent gamma-ray bursts (GRBs) with\ninitial X-ray positions suggesting associations with nearby galaxies (z < 0.7).\nTheir prompt emission characteristics indicate GRB 211106A is a short-duration\nGRB and GRB 211227A is a short GRB with extended emission, likely originating\nfrom compact binary mergers. However, classifying solely based on prompt\nemission can be misleading. Aims: These short GRBs in the local Universe offer\nopportunities to search for associated kilonova (KN) emission and study host\ngalaxy properties in detail. Methods: We conducted deep optical and NIR\nfollow-up using ESO-VLT FORS2, HAWK-I, and MUSE for GRB 211106A, and ESO-VLT\nFORS2 and X-Shooter for GRB 211227A, starting shortly after the X-ray afterglow\ndetection. We performed photometric analysis to look for afterglow and KN\nemissions associated with the bursts, along with host galaxy imaging and\nspectroscopy. Optical/NIR results were compared with Swift X-Ray Telescope\n(XRT) and other high-energy data. Results: For both GRBs we placed deep limits\nto the optical/NIR afterglow and KN emission. Host galaxies were identified:\nGRB 211106A at photometric z = 0.64 and GRB 211227A at spectroscopic z = 0.228.\nHost galaxy properties aligned with typical short GRB hosts. We also compared\nthe properties of the bursts with the S-BAT4 sample to further examined the\nnature of these events. Conclusions: Study of prompt and afterglow phases,\nalong with host galaxy analysis, confirms GRB 211106A as a short GRB and GRB\n211227A as a short GRB with extended emission. The absence of optical/NIR\ncounterparts is likely due to local extinction for GRB 211106A and a faint\nkilonova for GRB 211227A.",
  "categories": [
    "astro-ph.HE"
  ],
  "arxiv_id": "2309.03000"
}