{
  "title": "MUSIC Algorithm for IRS-Assisted AOA Estimation",
  "authors": [
    "Qipeng Wang",
    "Liang Liu",
    "Shuowen Zhang"
  ],
  "submission_date": "2023-09-06T12:25:57+00:00",
  "revised_dates": [
    "2023-09-06T12:25:57+00:00"
  ],
  "publication_venue": null,
  "abstract": "Based on the signals received across its antennas, a multi-antenna base\nstation (BS) can apply the classic multiple signal classification (MUSIC)\nalgorithm for estimating the angle of arrivals (AOAs) of its incident signals.\nThis method can be leveraged to localize the users if their line-of-sight (LOS)\npaths to the BS are available. In this paper, we consider a more challenging\nAOA estimation setup in the intelligent reflecting surface (IRS) assisted\nintegrated sensing and communication (ISAC) system, where LOS paths do not\nexist between the BS and the users, while the users' signals can be transmitted\nto the BS merely via their LOS paths to the IRS as well as the LOS path from\nthe IRS to the BS. Specifically, we treat the IRS as the anchor and are\ninterested in estimating the AOAs of the incident signals from the users to the\nIRS. Note that we have to achieve the above goal based on the signals received\nby the BS, because the passive IRS cannot process its received signals.\nHowever, the signals received across different antennas of the BS only contain\nAOA information of its incident signals via the LOS path from the IRS to the\nBS. To tackle this challenge arising from the spatial-domain received signals,\nwe propose an innovative approach to create temporal-domain multi-dimension\nreceived signals for estimating the AOAs of the paths from the users to the\nIRS. Specifically, via a proper design of the user message pattern and the IRS\nreflecting pattern, we manage to show that our designed temporal-domain\nmulti-dimension signals can be surprisingly expressed as a function of the\nvirtual steering vectors of the IRS towards the users. This amazing result\nimplies that the classic MUSIC algorithm can be applied to our designed\ntemporal-domain multi-dimension signals for accurately estimating the AOAs of\nthe signals from the users to the IRS.",
  "categories": [
    "eess.SP",
    "cs.IT",
    "math.IT"
  ],
  "arxiv_id": "2309.02947"
}