{
  "title": "Realizing the Nishimori transition across the error threshold for constant-depth quantum circuits",
  "authors": [
    "Edward H. Chen",
    "Guo-Yi Zhu",
    "Ruben Verresen",
    "Alireza Seif",
    "Elisa Bäumer",
    "David Layden",
    "Nathanan Tantivasadakarn",
    "Guanyu Zhu",
    "Sarah Sheldon",
    "Ashvin Vishwanath",
    "Simon Trebst",
    "Abhinav Kandala"
  ],
  "submission_date": "2023-09-06T09:43:12+00:00",
  "revised_dates": [
    "2023-12-08T13:18:52+00:00"
  ],
  "publication_venue": "Nature Physics 21, 161 (2025)",
  "abstract": "Preparing quantum states across many qubits is necessary to unlock the full\npotential of quantum computers. However, a key challenge is to realize\nefficient preparation protocols which are stable to noise and gate\nimperfections. Here, using a measurement-based protocol on a 127\nsuperconducting qubit device, we study the generation of the simplest\nlong-range order -- Ising order, familiar from Greenberger-Horne-Zeilinger\n(GHZ) states and the repetition code -- on 54 system qubits. Our efficient\nimplementation of the constant-depth protocol and classical decoder shows\nhigher fidelities for GHZ states compared to size-dependent, unitary protocols.\nBy experimentally tuning coherent and incoherent error rates, we demonstrate\nstability of this decoded long-range order in two spatial dimensions, up to a\ncritical point which corresponds to a transition belonging to the unusual\nNishimori universality class. Although in classical systems Nishimori physics\nrequires fine-tuning multiple parameters, here it arises as a direct result of\nthe Born rule for measurement probabilities -- locking the effective\ntemperature and disorder driving this transition. Our study exemplifies how\nmeasurement-based state preparation can be meaningfully explored on quantum\nprocessors beyond a hundred qubits.",
  "categories": [
    "quant-ph",
    "cond-mat.dis-nn",
    "cond-mat.stat-mech",
    "cond-mat.str-el"
  ],
  "arxiv_id": "2309.02863"
}