{
  "title": "Natural and Robust Walking using Reinforcement Learning without Demonstrations in High-Dimensional Musculoskeletal Models",
  "authors": [
    "Pierre Schumacher",
    "Thomas Geijtenbeek",
    "Vittorio Caggiano",
    "Vikash Kumar",
    "Syn Schmitt",
    "Georg Martius",
    "Daniel F. B. Haeufle"
  ],
  "submission_date": "2023-09-06T13:20:31+00:00",
  "revised_dates": [
    "2023-09-07T15:23:29+00:00"
  ],
  "publication_venue": null,
  "abstract": "Humans excel at robust bipedal walking in complex natural environments. In\neach step, they adequately tune the interaction of biomechanical muscle\ndynamics and neuronal signals to be robust against uncertainties in ground\nconditions. However, it is still not fully understood how the nervous system\nresolves the musculoskeletal redundancy to solve the multi-objective control\nproblem considering stability, robustness, and energy efficiency. In computer\nsimulations, energy minimization has been shown to be a successful optimization\ntarget, reproducing natural walking with trajectory optimization or\nreflex-based control methods. However, these methods focus on particular\nmotions at a time and the resulting controllers are limited when compensating\nfor perturbations. In robotics, reinforcement learning~(RL) methods recently\nachieved highly stable (and efficient) locomotion on quadruped systems, but the\ngeneration of human-like walking with bipedal biomechanical models has required\nextensive use of expert data sets. This strong reliance on demonstrations often\nresults in brittle policies and limits the application to new behaviors,\nespecially considering the potential variety of movements for high-dimensional\nmusculoskeletal models in 3D. Achieving natural locomotion with RL without\nsacrificing its incredible robustness might pave the way for a novel approach\nto studying human walking in complex natural environments. Videos:\nhttps://sites.google.com/view/naturalwalkingrl",
  "categories": [
    "cs.RO",
    "cs.LG"
  ],
  "arxiv_id": "2309.02976"
}