{
  "title": "Robust Sandwiched B/TM/B Structures by Metal Intercalating into Bilayer Borophene Leading to Excellent Hydrogen Evolution Reaction",
  "authors": [
    "Yuan Chang",
    "Hongsheng Liu",
    "Jiaxu Liu",
    "Jijun Zhao",
    "Yong-Wei Zhang",
    "Junfeng Gao"
  ],
  "submission_date": "2023-09-06T12:59:51+00:00",
  "revised_dates": [
    "2023-09-06T12:59:51+00:00"
  ],
  "publication_venue": "Advanced Energy Materials, 2023, 13, 2301331",
  "abstract": "Bilayer borophene, very recently synthesized on Ag and Cu, possesses\nextremely flat large surface and excellent conductivity. Besides, the van der\nWaals gap of bilayer borophene can be intercalated by metal atoms, thereby\ntailoring the properties of bilayer borophene. Herein, we propose that\nsandwiched B/TM/B (TM=Co, Ni, Cu, Pd) could be a new 2D formation by transiton\nmetal atoms intercalated into bilayer borophene network, it is quiet robust\nwith both energetic, structural and thermal stability, and exhibits heat\nresistance of at least 1300 K. Besides, it is novel platform for\nelectrocatalytic hydrogen evolution reaction (HER). The interecalation metal\natom serves as single-atomic catalyst, which acting the nonmetal boron layers.\nBeyond that, the transtion metal is protected by outside boron layers from\nbeing corroded by acidic/alkaline solution. B/Cux/B, B/Pdx/B and B/Alx/B with\ndifferent metal coverage exhibit defect-independent extremely low HER free\nenergy in the range of -0.162 ~ 0.179 eV, -0.134 ~ 0.183 eV and -0.082 ~ 0.086\neV which are comparable to noble metal Pt. Combining excellent conduction, high\nstructural and thermal stability, low resistance to intercalated behaviour,\neffortless water splitting process, excellent defect-independent catalytic\nperformance, cheapness and abundance of raw materials, free of corrodation, 2D\nsandwiched B/TM/B (TM=Co, Ni, Cu, Pd) is believed to promising for\nelectrocatalytic HER applications.",
  "categories": [
    "cond-mat.mtrl-sci"
  ],
  "arxiv_id": "2309.02963"
}