{
  "title": "Post-melting encapsulation of glass microwires for multipath light waveguiding within phosphate glasses",
  "authors": [
    "I. Konidakis",
    "F. Dragosli",
    "A. Cheruvathoor Poulose",
    "J. Kašlík",
    "A. Bakandristos",
    "R. Zboril",
    "E. Stratakis"
  ],
  "submission_date": "2023-09-06T12:52:44+00:00",
  "revised_dates": [
    "2023-09-06T12:52:44+00:00"
  ],
  "publication_venue": null,
  "abstract": "Glass waveguides remain the fundamental component of advanced photonic\ncircuits and with a significant role in other applications such as quantum\ninformation processing, light generation, imaging, data storage, and sensing\nplatforms. Up to date, the fabrication of glass waveguides relies mainly on\ndemanding chemical processes or on the employment of expensive ultrafast laser\nequipment. In this work, we demonstrate the feasibility of a simple,\nlow-temperature, post-melting encapsulation procedure for the development of\nadvanced glass waveguides. Namely, silver iodide phosphate glass microwires\n(MWs) are drawn from typical splat-quenched samples. Following this, the MWs\nare incorporated in a controlled manner within previously prepared transparent\nsilver phosphate glass rectangular prisms. The composition of the employed\nglasses is chosen so that the host phosphate glass has a lower refractive index\nthan the embedded MWs. In such case, the waveguide mechanism relies on the\npropagation of light inside the encapsulated higher refractive index MWs.\nMoreover, the presence of silver nanoparticles within the MWs enhances the\nlight transmission due to scattering effects. Waveguide devices with either one\nor two incorporated MWs were fabricated. Remarkably, in the latter case, the\ntransmission of light of different colors and in multipath direction is\npossible, rendering the developed waveguides outstanding candidates for various\nphotonic circuits, optoelectronic, and smart sign glass applications.",
  "categories": [
    "physics.optics",
    "cond-mat.mtrl-sci"
  ],
  "arxiv_id": "2309.02958"
}