{
  "title": "On computing the jump condition of the dissipation rate in the two-equation turbulence models for two-phase flow and application to air-water waves",
  "authors": [
    "Omar Elsayed",
    "Benjamin Bouscasse",
    "Maité Gouin",
    "David Le Touzé"
  ],
  "submission_date": "2023-09-06T11:33:46+00:00",
  "revised_dates": [
    "2023-11-27T10:19:24+00:00"
  ],
  "publication_venue": null,
  "abstract": "Traditional turbulence models are derived for single-phase flow. Extension of\nthe family of two-equation turbulence models for two-phase flow is obtained via\nscaling the transport equations by the density. In the special case of\ntwo-phase flow with a sharp interface, jump conditions exist. Two types of jump\nconditions are found: (1) jump in the partial differential equation (PDE)\nphysical quantities such as density and viscosity and (2) jump in the\nturbulence frequency. We first derive and clarify the jump in the equations.\nThe jump in the turbulence frequency is proportional to the kinematic viscosity\nratio, which is approximately $10$ in the case of air-water. Then a new field,\nthe inverse turbulence area, is considered to model the turbulence effects\ninstead of the turbulence frequency. For the system of air and water, the\neffect of the jump of the kinematic viscosity is always greater than the effect\narising from the jump of velocity gradient. This approximation leads to the\nassumption of a continuous inverse turbulence area scale. Validation versus\nexperimental measurements from the literature is then presented to demonstrate\nthe improvement of the model. In particular, the wave breaking phenomenon is\nsimulated in two conditions: spilling and plunging wave breakers. The proposed\nmodel shows its ability to predict the turbulence in the surf zone accurately.\nFinally, it explains the low values of the time-averaged turbulent kinetic\nenergy in the surf zone which is caused by the increase of the turbulence\nfrequency in the air.",
  "categories": [
    "physics.flu-dyn"
  ],
  "arxiv_id": "2309.02924"
}