{
  "title": "Demystifying RCE Vulnerabilities in LLM-Integrated Apps",
  "authors": [
    "Tong Liu",
    "Zizhuang Deng",
    "Guozhu Meng",
    "Yuekang Li",
    "Kai Chen"
  ],
  "submission_date": "2023-09-06T11:39:37+00:00",
  "revised_dates": [
    "2025-02-27T02:22:07+00:00"
  ],
  "publication_venue": "Proceedings of the 2024 on ACM SIGSAC Conference on Computer and\n  Communications Security (CCS '24)",
  "abstract": "LLMs show promise in transforming software development, with a growing\ninterest in integrating them into more intelligent apps. Frameworks like\nLangChain aid LLM-integrated app development, offering code execution\nutility/APIs for custom actions. However, these capabilities theoretically\nintroduce Remote Code Execution (RCE) vulnerabilities, enabling remote code\nexecution through prompt injections. No prior research systematically\ninvestigates these frameworks' RCE vulnerabilities or their impact on\napplications and exploitation consequences. Therefore, there is a huge research\ngap in this field. In this study, we propose LLMSmith to detect, validate and\nexploit the RCE vulnerabilities in LLM-integrated frameworks and apps. To\nachieve this goal, we develop two novel techniques, including 1) a lightweight\nstatic analysis to examine LLM integration mechanisms, and construct call\nchains to identify RCE vulnerabilities in frameworks; 2) a systematical\nprompt-based exploitation method to verify and exploit the found\nvulnerabilities in LLM-integrated apps. This technique involves various\nstrategies to control LLM outputs, trigger RCE vulnerabilities and launch\nsubsequent attacks. Our research has uncovered a total of 20 vulnerabilities in\n11 LLM-integrated frameworks, comprising 19 RCE vulnerabilities and 1 arbitrary\nfile read/write vulnerability. Of these, 17 have been confirmed by the\nframework developers, with 11 vulnerabilities being assigned CVE IDs. For the\n51 apps potentially affected by RCE, we successfully executed attacks on 17\napps, 16 of which are vulnerable to RCE and 1 to SQL injection. Furthermore, we\nconduct a comprehensive analysis of these vulnerabilities and construct\npractical attacks to demonstrate the hazards in reality. Last, we propose\nseveral mitigation measures for both framework and app developers to counteract\nsuch attacks.",
  "categories": [
    "cs.CR"
  ],
  "arxiv_id": "2309.02926"
}