{
  "title": "Multi-Device Task-Oriented Communication via Maximal Coding Rate Reduction",
  "authors": [
    "Chang Cai",
    "Xiaojun Yuan",
    "Ying-Jun Angela Zhang"
  ],
  "submission_date": "2023-09-06T10:21:33+00:00",
  "revised_dates": [
    "2024-05-28T09:36:33+00:00"
  ],
  "publication_venue": null,
  "abstract": "In task-oriented communications, most existing work designed the\nphysical-layer communication modules and learning based codecs with distinct\nobjectives: learning is targeted at accurate execution of specific tasks, while\ncommunication aims at optimizing conventional communication metrics, such as\nthroughput maximization, delay minimization, or bit error rate minimization.\nThe inconsistency between the design objectives may hinder the exploitation of\nthe full benefits of task-oriented communications. In this paper, we consider a\ntask-oriented multi-device edge inference system over a multiple-input\nmultiple-output (MIMO) multiple-access channel, where the learning (i.e.,\nfeature encoding and classification) and communication (i.e., precoding)\nmodules are designed with the same goal of inference accuracy maximization.\nInstead of end-to-end learning which involves both the task dataset and\nwireless channel during training, we advocate a separate design of learning and\ncommunication to achieve the consistent goal. Specifically, we leverage the\nmaximal coding rate reduction (MCR2) objective as a surrogate to represent the\ninference accuracy, which allows us to explicitly formulate the precoding\noptimization problem. We cast valuable insights into this formulation and\ndevelop a block coordinate ascent (BCA) algorithm for efficient\nproblem-solving. Moreover, the MCR2 objective serves the loss function for\nfeature encoding and guides the classification design. Simulation results on\nthe synthetic features explain the mechanism of MCR2 precoding at different\nSNRs. We also validate on the CIFAR-10 and ModelNet10 datasets that the\nproposed design achieves a better latency-accuracy tradeoff compared to various\nbaselines. As such, our work paves the way for further exploration into the\nsynergistic alignment of learning and communication objectives in task-oriented\ncommunication systems.",
  "categories": [
    "eess.SP"
  ],
  "arxiv_id": "2309.02888"
}