{
  "title": "FaultSSL: Seismic Fault Detection via Semi-supervised learning",
  "authors": [
    "Yimin Dou",
    "Minghui Dong",
    "Kewen Li",
    "Y uan Xiao"
  ],
  "submission_date": "2023-09-06T11:42:49+00:00",
  "revised_dates": [
    "2023-09-14T04:04:14+00:00"
  ],
  "publication_venue": null,
  "abstract": "The prevailing methodology in data-driven fault detection leverages synthetic\ndata for training neural networks. However, it grapples with challenges when it\ncomes to generalization in surveys exhibiting complex structures. To enhance\nthe generalization of models trained on limited synthetic datasets to a broader\nrange of real-world data, we introduce FaultSSL, a semi-supervised fault\ndetection framework. This method is based on the classical mean teacher\nstructure, with its supervised part employs synthetic data and a few 2D labels.\nThe unsupervised component relying on two meticulously devised proxy tasks,\nallowing it to incorporate vast unlabeled field data into the training process.\nThe two proxy tasks are PaNning Consistency (PNC) and PaTching Consistency\n(PTC). PNC emphasizes the feature consistency of the overlapping regions\nbetween two adjacent views in predicting the model. This allows for the\nextension of 2D slice labels to the global seismic volume. PTC emphasizes the\nspatially consistent nature of faults. It ensures that the predictions for the\nseismic, whether made on the entire volume or on individual patches, exhibit\ncoherence without any noticeable artifacts at the patch boundaries. While the\ntwo proxy tasks serve different objectives, they uniformly contribute to the\nenhancement of performance. Experiments showcase the exceptional performance of\nFaultSSL. In surveys where other mainstream methods fail to deliver, we present\nreliable, continuous, and clear detection results. FaultSSL breaks the shackles\nof synthetic data, unveiling a promising route for incorporating copious\namounts of field data into training and fostering model generalization across a\nbroader spectrum of surveys.",
  "categories": [
    "physics.geo-ph"
  ],
  "arxiv_id": "2309.02930"
}