{
  "title": "Mapper of the IGM spin temperature: instrument overview",
  "authors": [
    "R. A. Monsalve",
    "C. Altamirano",
    "V. Bidula",
    "R. Bustos",
    "C. H. Bye",
    "H. C. Chiang",
    "M. Diaz",
    "B. Fernandez",
    "X. Guo",
    "I. Hendricksen",
    "E. Hornecker",
    "F. Lucero",
    "H. Mani",
    "F. McGee",
    "F. P. Mena",
    "M. Pessoa",
    "G. Prabhakar",
    "O. Restrepo",
    "J. L. Sievers",
    "N. Thyagarajan"
  ],
  "submission_date": "2023-09-06T13:37:07+00:00",
  "revised_dates": [
    "2024-05-24T02:15:53+00:00"
  ],
  "publication_venue": "Monthly Notices of the Royal Astronomical Society, Volume 530,\n  Issue 4, June 2024, Pages 4125-4147",
  "abstract": "The observation of the global 21 cm signal produced by neutral hydrogen gas\nin the intergalactic medium (IGM) during the Dark Ages, Cosmic Dawn, and Epoch\nof Reionization requires measurements with extremely well-calibrated wideband\nradiometers. We describe the design and characterization of the Mapper of the\nIGM Spin Temperature (MIST), which is a new ground-based, single-antenna,\nglobal 21 cm experiment. The design of MIST was guided by the objectives of\navoiding systematics from an antenna ground plane and cables around the\nantenna, as well as maximizing the instrument's on-sky efficiency and\nportability for operations at remote sites. We have built two MIST instruments,\nwhich observe in the range 25-105 MHz. For the 21 cm signal, this frequency\nrange approximately corresponds to redshifts 55.5 > z > 12.5, encompassing the\nDark Ages and Cosmic Dawn. The MIST antenna is a horizontal blade dipole of\n2.42 m in length, 60 cm in width, and 52 cm in height above the ground. This\nantenna operates without a metal ground plane. The instruments run on 12 V\nbatteries and have a maximum power consumption of 17 W. The batteries and\nelectronics are contained in a single receiver box located under the antenna.\nWe present the characterization of the instruments using electromagnetic\nsimulations and lab measurements. We also show sample sky measurements from\nrecent observations at remote sites in California, Nevada, and the Canadian\nHigh Arctic. These measurements indicate that the instruments perform as\nexpected. Detailed analyses of the sky measurements are left for future work.",
  "categories": [
    "astro-ph.IM",
    "astro-ph.CO"
  ],
  "arxiv_id": "2309.02996"
}