{
  "title": "FishMOT: A Simple and Effective Method for Fish Tracking Based on IoU Matching",
  "authors": [
    "Shuo Liu",
    "Lulu Han",
    "Xiaoyang Liu",
    "Junli Ren",
    "Fang Wang",
    "YingLiu",
    "Yuanshan Lin"
  ],
  "submission_date": "2023-09-06T13:16:41+00:00",
  "revised_dates": [
    "2023-09-22T03:58:24+00:00"
  ],
  "publication_venue": null,
  "abstract": "Fish tracking plays a vital role in understanding fish behavior and ecology.\nHowever, existing tracking methods face challenges in accuracy and robustness\ndues to morphological change of fish, occlusion and complex environment. This\npaper proposes FishMOT(Multiple Object Tracking for Fish), a novel fish\ntracking approach combining object detection and IoU matching, including basic\nmodule, interaction module and refind module. Wherein, a basic module performs\ntarget association based on IoU of detection boxes between successive frames to\ndeal with morphological change of fish; an interaction module combines IoU of\ndetection boxes and IoU of fish entity to handle occlusions; a refind module\nuse spatio-temporal information uses spatio-temporal information to overcome\nthe tracking failure resulting from the missed detection by the detector under\ncomplex environment. FishMOT reduces the computational complexity and memory\nconsumption since it does not require complex feature extraction or identity\nassignment per fish, and does not need Kalman filter to predict the detection\nboxes of successive frame. Experimental results demonstrate FishMOT outperforms\nstate-of-the-art multi-object trackers and specialized fish tracking tools in\nterms of MOTA, accuracy, computation time, memory consumption, etc..\nFurthermore, the method exhibits excellent robustness and generalizability for\nvarying environments and fish numbers. The simplified workflow and strong\nperformance make FishMOT as a highly effective fish tracking approach. The\nsource codes and pre-trained models are available at:\nhttps://github.com/gakkistar/FishMOT",
  "categories": [
    "cs.CV"
  ],
  "arxiv_id": "2309.02975"
}