{
  "title": "A Bayesian estimation of the Milky Way's circular velocity curve using Gaia DR3",
  "authors": [
    "Sven Põder",
    "María Benito",
    "Joosep Pata",
    "Rain Kipper",
    "Heleri Ramler",
    "Gert Hütsi",
    "Indrek Kolka",
    "Guillaume F. Thomas"
  ],
  "submission_date": "2023-09-06T10:36:05+00:00",
  "revised_dates": [
    "2023-09-06T10:36:05+00:00"
  ],
  "publication_venue": "A&A, 676 (2023) A134",
  "abstract": "Our goal is to calculate the circular velocity curve of the Milky Way, along\nwith corresponding uncertainties that quantify various sources of systematic\nuncertainty in a self-consistent manner. The observed rotational velocities are\ndescribed as circular velocities minus the asymmetric drift. The latter is\ndescribed by the radial axisymmetric Jeans equation. We thus reconstruct the\ncircular velocity curve between Galactocentric distances from 5 kpc to 14 kpc\nusing a Bayesian inference approach. The estimated error bars quantify\nuncertainties in the Sun's Galactocentric distance and the spatial-kinematic\nmorphology of the tracer stars. As tracers, we used a sample of roughly 0.6\nmillion stars on the red giant branch stars with six-dimensional phase-space\ncoordinates from Gaia data release 3 (DR3). More than 99% of the sample is\nconfined to a quarter of the stellar disc with mean radial, rotational, and\nvertical velocity dispersions of $(35\\pm 18)\\,\\rm km/s$, $(25\\pm 13)\\,\\rm\nkm/s$, and $(19\\pm 9)\\,\\rm km/s$, respectively. We find a circular velocity\ncurve with a slope of $0.4\\pm 0.6\\,\\rm km/s/kpc$, which is consistent with a\nflat curve within the uncertainties. We further estimate a circular velocity at\nthe Sun's position of $v_c(R_0)=233\\pm7\\, \\rm km/s$ and that a region in the\nSun's vicinity, characterised by a physical length scale of $\\sim 1\\,\\rm kpc$,\nmoves with a bulk motion of $V_{LSR} =7\\pm 7\\,\\rm km/s$. Finally, we estimate\nthat the dark matter (DM) mass within 14 kpc is $\\log_{10}M_{\\rm DM}(R<14\\,\n{\\rm kpc})/{\\rm M_{\\odot}}= \\left(11.2^{+2.0}_{-2.3}\\right)$ and the local\nspherically averaged DM density is $\\rho_{\\rm\nDM}(R_0)=\\left(0.41^{+0.10}_{-0.09}\\right)\\,{\\rm\nGeV/cm^3}=\\left(0.011^{+0.003}_{-0.002}\\right)\\,{\\rm M_\\odot/pc^3}$. In\naddition, the effect of biased distance estimates on our results is assessed.",
  "categories": [
    "astro-ph.GA"
  ],
  "arxiv_id": "2309.02895"
}